state machine details
